Here you will find few of the configuration which I use in my Linux
system. You can tailor it according it to your needs.

* Configuration

- [[file:machines/latitude-7490/][Latitude 7490 configuration]]
- [[file:machines/nuc8i7beh/][NUC8I7BEH Configuration]]
- [[file:machines/home-manager/][Home manager configuration]]
- [[file:machines/home-manager/packages.nix][packages.nix]]
- [[file:cnx/][CNX]]
- [[file:xmonad/][XMonad]]
- [[file:xmobar/][XMobar (Outdated: Migrated to CNX instead)]]
- [[file:.emacs.d/][Emacs configuration]]
- [[file:machines/packages/][Nix Packages (Maintained out of tree)]]

* Usage

#+begin_src sh :exports both :results verbatim
just
#+end_src

#+RESULTS:
: Available recipes:
:     default  # List all recipies
:     home-nuc # Symlink for NUC home-manager

* Old docs

- [[file:FRESH.md][Fresh System configuraion]]
- [[file:GPG.gmd][GPG docs]]
- [[file:Mac.md][Mac notes]]
